# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables
**IMPORTANT:** The following exercise depends on first having successing completed Exercise 1: Step 4. 

Start by running the code in the cell below to connect to the database. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 through 4, then skip to the second cell.

In [1]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = 'xxxxx'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://postgres:Met/14/7472@127.0.0.1:5432/pagila

In [2]:
%sql $conn_string

### Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

First, you create a table called test_table.

In [3]:
%%sql
CREATE TABLE test_table
(
    date timestamp,
    revenue decimal(5,2)
);

 * postgresql://postgres:***@127.0.0.1:5432/pagila
Done.

[]

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [4]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date, 
        amount AS revenue
FROM payment;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

Then you can use a SELECT statement to take a look at the new table.

In [5]:
%sql SELECT * FROM test_table LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(datetime.datetime(2020, 1, 24, 22, 40, 19, 996577), Decimal('1.99')),
 (datetime.datetime(2020, 1, 25, 16, 16, 50, 996577), Decimal('0.99')),
 (datetime.datetime(2020, 1, 28, 22, 44, 14, 996577), Decimal('6.99')),
 (datetime.datetime(2020, 1, 29, 1, 58, 2, 996577), Decimal('0.99')),
 (datetime.datetime(2020, 1, 29, 9, 10, 6, 996577), Decimal('4.99'))]

In [6]:
%sql DROP TABLE test_table;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
Done.

[]

Great! Now you'll do the same thing below to create the dimension and fact tables for the Star Schema using the data in the 3NF database.

## ETL from 3NF to Star Schema

In [13]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
40 rows affected.

[]

TODO: Now it's your turn. Populate the `dimCustomer` table with data from the `customer`, `address`, `city`, and `country` tables. Use the starter code as a guide.

In [12]:
%%sql
INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT c.customer_id AS customer_key,
       c.customer_id,
       c.first_name,
       c.last_name,
       c.email,
       a.address,
       a.address2,
       a.district,
       ci.city,
       co.country,
       postal_code,
       a.phone,
       c.active,
       c.create_date,
       now()         AS start_date,
       now()         AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://postgres:***@127.0.0.1:5432/pagila
599 rows affected.

[]

TODO: Populate the `dimMovie` table with data from the `film` and `language` tables. Use the starter code as a guide.

In [14]:
%%sql
INSERT INTO dimMovie (movie_key, film_id, title, description, release_year, language,
                      original_language, rental_duration, length, rating, special_features)

SELECT f.film_id as movie_key,
       f.film_id,
       f.title,
       f.description,
       f.release_year,
       l.name AS language,
       orig_lang.name AS original_language,
       f.rental_duration,
       f.length,
       f.rating,
       f.special_features
    
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

TODO: Populate the `dimStore` table with data from the `store`, `staff`, `address`, `city`, and `country` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [15]:
%%sql
INSERT INTO dimStore (store_key, store_id, address, address2, district, city, country, postal_code, manager_first_name, manager_last_name, start_date, end_date)

SELECT s.store_id as store_key,
       s.store_id,
       a.address,
       a.address2,
       a.district,
       ci.city, 
       co.country, 
       a.postal_code,
       st.first_name as manager_first_name,
       st.last_name as manager_last_name,
       now() as start_date,
       now() as end_date
FROM store s
JOIN staff st ON (s.manager_staff_id = st.staff_id)
JOIN address a ON (st.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://postgres:***@127.0.0.1:5432/pagila
2 rows affected.

[]

TODO: Populate the `factSales` table with data from the `payment`, `rental`, and `inventory` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [16]:
%%sql
INSERT INTO factSales (date_key, 
                       customer_key, 
                       movie_key, 
                       store_key, 
                       sales_amount
                      )

SELECT DISTINCT(TO_CHAR(p.payment_date :: DATE, 'yyyyMMDD')::integer)   AS date_key, 
       p.customer_id                                                    AS customer_key,
       i.film_id                                                        AS movie_key,
       i.store_id                                                       AS store_key, 
       p.amount                                                         AS sales_amount

FROM payment p
JOIN rental r ON (p.customer_id = r.customer_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id);

 * postgresql://postgres:***@127.0.0.1:5432/pagila
410321 rows affected.

[]